Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:45]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-054faa68dbb4bc84b]
module.iam.aws_iam_role.bastion_ssm_role: Refreshing state... [id=BastionSSMRole]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250702031033434900000004]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250702031033443600000006]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250702031033402400000003]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250702031033486100000007]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250702031033390100000001]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250702031033399100000002]
module.iam.aws_iam_role_policy_attachment.ssm_core: Refreshing state... [id=BastionSSMRole-20250702031033438100000005]
module.iam.aws_iam_instance_profile.bastion_ssm_profile: Refreshing state... [id=bastion-ssm-profile]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0ad16645d934c7a00]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-05363465369f56064]
module.security_group.aws_security_group.lambda_sg: Refreshing state... [id=sg-09eaa327062bc1a56]
module.security_group.aws_security_group.bastion_sg: Refreshing state... [id=sg-0ba8e6d438aea8eac]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-05c79380193ae6595]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-02cd6d0da113f8cb1]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0acc8997fe1d712c8]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0dea12799c7f4d7ba]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-0e0682f9536b2eeb0]
module.route.aws_route_table.private: Refreshing state... [id=rtb-01817ebd154fa218e]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0adb1fc63db133c74]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-054646ea49a0427ac]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0cdc064acd4c63d04]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0adb1fc63db133c741080289494]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-0be7375455066d82a]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0de750020ea02dcf7]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-01817ebd154fa218e1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0daee08993156ca1a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "bastion-ssm-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-05c79380193ae6595"
      + tags                                 = {
          + "Name" = "bastion"
        }
      + tags_all                             = {
          + "Name" = "bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            yum update -y
            yum install -y amazon-ssm-agent
            systemctl enable amazon-ssm-agent
            systemctl start amazon-ssm-agent
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0ba8e6d438aea8eac",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.docker_images.aws_lambda_function.news-crawler_mw will be created
  + resource "aws_lambda_function" "news-crawler_mw" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "news-crawler-lambda"
      + id                             = (known after apply)
      + image_uri                      = (sensitive value)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::635140758252:role/lambda_sql_initializer_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 180
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-05363465369f56064",
              + "subnet-05c79380193ae6595",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "news-cluster"
      + platform_version              = (known after apply)
      + region                        = "ap-northeast-2"
      + role_arn                      = "arn:aws:iam::635140758252:role/EKSClusterRole"
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "news-cluster"
        }
      + tags_all                      = {
          + "Name" = "news-cluster"
        }
      + version                       = (known after apply)

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-05363465369f56064",
              + "subnet-05c79380193ae6595",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.default will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "news-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "news-cluster-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::635140758252:role/EKSNodeInstanceRole"
      + region                 = "ap-northeast-2"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05363465369f56064",
          + "subnet-05c79380193ae6595",
        ]
      + tags                   = {
          + "Name" = "news-cluster-ng"
        }
      + tags_all               = {
          + "Name" = "news-cluster-ng"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key = "my-kp"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da0c0e66e9a",
        ]
      + url             = (known after apply)
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["crawler"] will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Crawler runs every hour"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "crawler"
      + name_prefix         = (known after apply)
      + region              = "ap-northeast-2"
      + schedule_expression = "cron(50 0-23 ? * MON-FRI *)"
      + tags                = {
          + "Name" = "crawler"
        }
      + tags_all            = {
          + "Name" = "crawler"
        }
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["sending_news"] will be created
  + resource "aws_cloudwatch_event_rule" "schedule" {
      + arn                 = (known after apply)
      + description         = "Send news weekdays at 9AM"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sending_news"
      + name_prefix         = (known after apply)
      + region              = "ap-northeast-2"
      + schedule_expression = "cron(0 * ? * MON-FRI *)"
      + tags                = {
          + "Name" = "sending_news"
        }
      + tags_all            = {
          + "Name" = "sending_news"
        }
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["crawler"] will be created
  + resource "aws_cloudwatch_event_target" "lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + rule           = "crawler"
      + target_id      = "crawler"
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["sending_news"] will be created
  + resource "aws_cloudwatch_event_target" "lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-northeast-2"
      + rule           = "sending_news"
      + target_id      = "sending-news"
    }

  # module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"] will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-crawler-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-northeast-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-crawler"
      + statement_id_prefix = (known after apply)
    }

  # module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"] will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-lambda-handler"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-northeast-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-sending_news"
      + statement_id_prefix = (known after apply)
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "NewsSubscribe"
      + db_subnet_group_name                  = "news-rds"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "news-rds"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "news-rds-timezone"
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "ap-northeast-2"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "news-rds"
        }
      + tags_all                              = {
          + "Name" = "news-rds"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_parameter_group.timezone will be created
  + resource "aws_db_parameter_group" "timezone" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "mysql8.0"
      + id           = (known after apply)
      + name         = "news-rds-timezone"
      + name_prefix  = (known after apply)
      + region       = "ap-northeast-2"
      + skip_destroy = false
      + tags_all     = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_connection"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_results"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "collation_server"
          + value        = "utf8mb4_unicode_ci"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Seoul"
        }
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "news-rds"
      + name_prefix             = (known after apply)
      + region                  = "ap-northeast-2"
      + subnet_ids              = [
          + "subnet-05363465369f56064",
          + "subnet-05c79380193ae6595",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "news-rds"
        }
      + tags_all                = {
          + "Name" = "news-rds"
        }
      + vpc_id                  = (known after apply)
    }

  # module.security_group.aws_security_group.eks_sg will be created
  + resource "aws_security_group" "eks_sg" {
      + arn                    = (known after apply)
      + description            = "EKS node group security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "From ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH from bastion (SSM Session Manager)"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0ba8e6d438aea8eac",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "eks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "eks-sg"
        }
      + tags_all               = {
          + "Name" = "eks-sg"
        }
      + vpc_id                 = "vpc-054faa68dbb4bc84b"
    }

  # module.security_group.aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "RDS security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "MySQL from app"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-sg"
        }
      + tags_all               = {
          + "Name" = "rds-sg"
        }
      + vpc_id                 = "vpc-054faa68dbb4bc84b"
    }

  # module.sending_news.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sending_news/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "../../modules/lambda/sending_news/lambda_function.py"
      + type                = "zip"
    }

  # module.sending_news.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sending_news/lambda_function.zip"
      + function_name                  = "news-lambda-handler"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:45",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::635140758252:role/lambda_sql_initializer_role"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-09eaa327062bc1a56",
            ]
          + subnet_ids                  = [
              + "subnet-05363465369f56064",
              + "subnet-05c79380193ae6595",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be created
  + resource "aws_lambda_function" "sql_initializer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sql_initializer/sql_init.zip"
      + function_name                  = "rds-sql-initializer"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:45",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::635140758252:role/lambda_sql_initializer_role"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-09eaa327062bc1a56",
            ]
          + subnet_ids                  = [
              + "subnet-05363465369f56064",
              + "subnet-05c79380193ae6595",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->